results/performance_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: performance_test_optimized.js
        output: json (./results/performance_results.json)

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 10 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/10 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 01/10 VUs  0m01.0s/1m00.0s

running (0m02.0s), 01/10 VUs, 3 complete and 0 interrupted iterations
default   [   3% ] 01/10 VUs  0m02.0s/1m00.0s

running (0m03.0s), 01/10 VUs, 5 complete and 0 interrupted iterations
default   [   5% ] 01/10 VUs  0m03.0s/1m00.0s

running (0m04.0s), 02/10 VUs, 7 complete and 0 interrupted iterations
default   [   7% ] 02/10 VUs  0m04.0s/1m00.0s

running (0m05.0s), 02/10 VUs, 11 complete and 0 interrupted iterations
default   [   8% ] 02/10 VUs  0m05.0s/1m00.0s

running (0m06.0s), 02/10 VUs, 14 complete and 0 interrupted iterations
default   [  10% ] 02/10 VUs  0m06.0s/1m00.0s

running (0m07.0s), 02/10 VUs, 18 complete and 0 interrupted iterations
default   [  12% ] 02/10 VUs  0m07.0s/1m00.0s

running (0m08.0s), 03/10 VUs, 21 complete and 0 interrupted iterations
default   [  13% ] 03/10 VUs  0m08.0s/1m00.0s

running (0m09.0s), 03/10 VUs, 27 complete and 0 interrupted iterations
default   [  15% ] 03/10 VUs  0m09.0s/1m00.0s

running (0m10.0s), 03/10 VUs, 33 complete and 0 interrupted iterations
default   [  17% ] 03/10 VUs  0m10.0s/1m00.0s

running (0m11.0s), 03/10 VUs, 39 complete and 0 interrupted iterations
default   [  18% ] 03/10 VUs  0m11.0s/1m00.0s

running (0m12.0s), 04/10 VUs, 46 complete and 0 interrupted iterations
default   [  20% ] 04/10 VUs  0m12.0s/1m00.0s

running (0m13.0s), 04/10 VUs, 54 complete and 0 interrupted iterations
default   [  22% ] 04/10 VUs  0m13.0s/1m00.0s

running (0m14.0s), 04/10 VUs, 61 complete and 0 interrupted iterations
default   [  23% ] 04/10 VUs  0m14.0s/1m00.0s

running (0m15.0s), 04/10 VUs, 69 complete and 0 interrupted iterations
default   [  25% ] 04/10 VUs  0m15.0s/1m00.0s

running (0m16.0s), 05/10 VUs, 77 complete and 0 interrupted iterations
default   [  27% ] 05/10 VUs  0m16.0s/1m00.0s

running (0m17.0s), 05/10 VUs, 85 complete and 0 interrupted iterations
default   [  28% ] 05/10 VUs  0m17.0s/1m00.0s

running (0m18.0s), 05/10 VUs, 95 complete and 0 interrupted iterations
default   [  30% ] 05/10 VUs  0m18.0s/1m00.0s

running (0m19.0s), 05/10 VUs, 105 complete and 0 interrupted iterations
default   [  32% ] 05/10 VUs  0m19.0s/1m00.0s

running (0m20.0s), 05/10 VUs, 115 complete and 0 interrupted iterations
default   [  33% ] 05/10 VUs  0m20.0s/1m00.0s

running (0m21.0s), 05/10 VUs, 125 complete and 0 interrupted iterations
default   [  35% ] 05/10 VUs  0m21.0s/1m00.0s

running (0m22.0s), 06/10 VUs, 136 complete and 0 interrupted iterations
default   [  37% ] 06/10 VUs  0m22.0s/1m00.0s

running (0m23.0s), 06/10 VUs, 148 complete and 0 interrupted iterations
default   [  38% ] 06/10 VUs  0m23.0s/1m00.0s

running (0m24.0s), 06/10 VUs, 157 complete and 0 interrupted iterations
default   [  40% ] 06/10 VUs  0m24.0s/1m00.0s

running (0m25.0s), 06/10 VUs, 168 complete and 0 interrupted iterations
default   [  42% ] 06/10 VUs  0m25.0s/1m00.0s

running (0m26.0s), 06/10 VUs, 179 complete and 0 interrupted iterations
default   [  43% ] 06/10 VUs  0m26.0s/1m00.0s

running (0m27.0s), 06/10 VUs, 191 complete and 0 interrupted iterations
default   [  45% ] 06/10 VUs  0m27.0s/1m00.0s

running (0m28.0s), 07/10 VUs, 204 complete and 0 interrupted iterations
default   [  47% ] 07/10 VUs  0m28.0s/1m00.0s

running (0m29.0s), 07/10 VUs, 218 complete and 0 interrupted iterations
default   [  48% ] 07/10 VUs  0m29.0s/1m00.0s

running (0m30.0s), 07/10 VUs, 231 complete and 0 interrupted iterations
default   [  50% ] 07/10 VUs  0m30.0s/1m00.0s

running (0m31.0s), 07/10 VUs, 245 complete and 0 interrupted iterations
default   [  52% ] 07/10 VUs  0m31.0s/1m00.0s

running (0m32.0s), 07/10 VUs, 258 complete and 0 interrupted iterations
default   [  53% ] 07/10 VUs  0m32.0s/1m00.0s

running (0m33.0s), 07/10 VUs, 270 complete and 0 interrupted iterations
default   [  55% ] 07/10 VUs  0m33.0s/1m00.0s

running (0m34.0s), 08/10 VUs, 285 complete and 0 interrupted iterations
default   [  57% ] 08/10 VUs  0m34.0s/1m00.0s

running (0m35.0s), 08/10 VUs, 299 complete and 0 interrupted iterations
default   [  58% ] 08/10 VUs  0m35.0s/1m00.0s

running (0m36.0s), 08/10 VUs, 314 complete and 0 interrupted iterations
default   [  60% ] 08/10 VUs  0m36.0s/1m00.0s

running (0m37.0s), 08/10 VUs, 330 complete and 0 interrupted iterations
default   [  62% ] 08/10 VUs  0m37.0s/1m00.0s

running (0m38.0s), 08/10 VUs, 346 complete and 0 interrupted iterations
default   [  63% ] 08/10 VUs  0m38.0s/1m00.0s

running (0m39.0s), 08/10 VUs, 361 complete and 0 interrupted iterations
default   [  65% ] 08/10 VUs  0m39.0s/1m00.0s

running (0m40.0s), 09/10 VUs, 378 complete and 0 interrupted iterations
default   [  67% ] 09/10 VUs  0m40.0s/1m00.0s

running (0m41.0s), 09/10 VUs, 396 complete and 0 interrupted iterations
default   [  68% ] 09/10 VUs  0m41.0s/1m00.0s

running (0m42.0s), 09/10 VUs, 410 complete and 0 interrupted iterations
default   [  70% ] 09/10 VUs  0m42.0s/1m00.0s

running (0m43.0s), 09/10 VUs, 426 complete and 0 interrupted iterations
default   [  72% ] 09/10 VUs  0m43.0s/1m00.0s

running (0m44.0s), 09/10 VUs, 444 complete and 0 interrupted iterations
default   [  73% ] 09/10 VUs  0m44.0s/1m00.0s

running (0m45.0s), 09/10 VUs, 462 complete and 0 interrupted iterations
default   [  75% ] 09/10 VUs  0m45.0s/1m00.0s

running (0m46.0s), 10/10 VUs, 480 complete and 0 interrupted iterations
default   [  77% ] 10/10 VUs  0m46.0s/1m00.0s

running (0m47.0s), 09/10 VUs, 500 complete and 0 interrupted iterations
default   [  78% ] 09/10 VUs  0m47.0s/1m00.0s

running (0m48.0s), 09/10 VUs, 517 complete and 0 interrupted iterations
default   [  80% ] 09/10 VUs  0m48.0s/1m00.0s

running (0m49.0s), 08/10 VUs, 534 complete and 0 interrupted iterations
default   [  82% ] 08/10 VUs  0m49.0s/1m00.0s

running (0m50.0s), 07/10 VUs, 549 complete and 0 interrupted iterations
default   [  83% ] 07/10 VUs  0m50.0s/1m00.0s

running (0m51.0s), 07/10 VUs, 561 complete and 0 interrupted iterations
default   [  85% ] 07/10 VUs  0m51.0s/1m00.0s

running (0m52.0s), 06/10 VUs, 573 complete and 0 interrupted iterations
default   [  87% ] 06/10 VUs  0m52.0s/1m00.0s

running (0m53.0s), 05/10 VUs, 584 complete and 0 interrupted iterations
default   [  88% ] 05/10 VUs  0m53.0s/1m00.0s

running (0m54.0s), 05/10 VUs, 594 complete and 0 interrupted iterations
default   [  90% ] 05/10 VUs  0m54.0s/1m00.0s

running (0m55.0s), 04/10 VUs, 603 complete and 0 interrupted iterations
default   [  92% ] 04/10 VUs  0m55.0s/1m00.0s

running (0m56.0s), 03/10 VUs, 611 complete and 0 interrupted iterations
default   [  93% ] 03/10 VUs  0m56.0s/1m00.0s

running (0m57.0s), 03/10 VUs, 617 complete and 0 interrupted iterations
default   [  95% ] 03/10 VUs  0m57.0s/1m00.0s

running (0m58.0s), 02/10 VUs, 622 complete and 0 interrupted iterations
default   [  97% ] 02/10 VUs  0m58.0s/1m00.0s

running (0m59.0s), 01/10 VUs, 626 complete and 0 interrupted iterations
default   [  98% ] 01/10 VUs  0m59.0s/1m00.0s

running (1m00.0s), 01/10 VUs, 628 complete and 0 interrupted iterations
default   [ 100% ] 01/10 VUs  1m00.0s/1m00.0s


  █ TOTAL RESULTS 

    checks_total.......................: 1258    20.814359/s
    checks_succeeded...................: 100.00% 1258 out of 1258
    checks_failed......................: 0.00%   0 out of 1258

    ✓ health API response time < 500ms
    ✓ metrics API response time < 1000ms

    HTTP
    http_req_duration......................: avg=14.33ms  min=11.36ms  med=12.91ms  max=136.05ms p(90)=16.53ms  p(95)=20.26ms 
    http_req_failed........................: 100.00% 1258 out of 1258
    http_reqs..............................: 1258    20.814359/s

    EXECUTION
    iteration_duration.....................: avg=529.93ms min=523.87ms med=527.05ms max=719.41ms p(90)=535.56ms p(95)=545.25ms
    iterations.............................: 629     10.40718/s
    vus....................................: 1       min=1            max=10
    vus_max................................: 10      min=10           max=10

    NETWORK
    data_received..........................: 17 MB   285 kB/s
    data_sent..............................: 138 kB  2.3 kB/s



running (1m00.4s), 00/10 VUs, 629 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/10 VUs  1m0s